{"input_lines": ["1967 Marburg virus outbreak", "Overview.", "In early August 1967, patients with unusual symptoms indicating an infectious disease were admitted to the university hospitals in Marburg and Frankfurt.", "The first patients were treated in their homes for up to 10 days, even though the illness was described as beginning suddenly with extreme malaise, myalgia, headache, and a rapid increase in body temperature to as high as 39 °C (102.2 °F) or more.", "Although the clinical symptoms were not very alarming during the first 3–4 days, additional symptoms and signs appeared at the end of the first week.", "The patients were therefore admitted to a hospital.", "In some cases, patients died from severe hemorrhagic shock on the day after hospital admission.", "Severe hemorrhagic shock occurred in about 25% of patients.", "All patients who died had hemorrhagic shock.", "The first infections occurred in laboratory workers who were conducting necropsies on imported African green monkeys.", "The incubation time of Marburg virus disease could only be estimated retrospectively, after the source of infection and the date of exposure were known.", "Incubation ranged from 5 to 9 days, with an average of 8 days.", "The ratio of primary to secondary infections was 21:3 in Marburg, 4:2 in Frankfurt, and 1:1 in Belgrade.", "Three cases of secondary infection resulted from inadvertent needle-stick inoculations; in one case, a pathology technician cut himself on the forearm with a knife during a postmortem examination.", "Airborne transmission between humans did not occur, as indicated, for example, by the instance of a young man who slept in the same bed with his brother only a couple of days before he died; the brother did not develop disease and was seronegative for Marburg virus disease six months later.", "Origin.", "The origin of the outbreaks was investigated at the same time as the microbiological studies.", "Early on in the investigation, it was realized that the patients in Marburg were employees of Behringwerke, a producer of sera and vaccines.", "The patients in Frankfurt were employees of Paul Ehrlich Institute, a control institute of sera and vaccines.", "While the primary case in Belgrade was an employee involved in testing of live vaccines.", "All the patients at the three locations had contact with blood, organs, and cell cultures from African green monkeys (\"Cercopithecus aethiops\").", "The monkeys' organs were used to make kidney cell culture for the production and safety testing of vaccines.", "The separate outbreaks were traced back to a shared shipment of infected green monkeys.", "Generally, shipments of green monkeys went directly from Uganda to Frankfurt.", "However, because of the Six Day War (5–10 June 1967), this shipment of monkeys was rerouted through London, where they were placed in animal storage because of a strike at the airport.", "After a two day delay, the monkeys were shipped to Frankfurt, and then to the laboratories in Frankfurt, Marburg, and Belgrade in June and July.", "The subsequent processing of the monkeys for cell culture at the three locations led to the laboratory-related outbreaks.", "The monkeys were believed to have been infected in Uganda, although infection from other animals in storage in London was also possible.", "History.", "The Marburg virus disease made reappearances in other countries in 1975, 1980, 1987, 1990, 1998–2000, 2004–05, 2007, 2008, 2017 and 2021.", "The seven deaths out of the 31 initially diagnosed infections during the 1967 Marburg virus outbreak represent a case fatality rate of 23%.", "The 32nd case was diagnosed retroactively via serology.", ""], "output_lines": ["The Marburg virus is a zoonotic virus, meaning that it can be transmitted from animals to humans.", "In the case of the 1967 Marburg virus outbreak, the virus was transmitted from African green monkeys to laboratory workers who were conducting necropsies on imported African green monkeys.", "The virus then spread from the laboratory workers to their family members and contacts, leading to a total of 31 cases of Marburg virus disease.", "Of the 31 cases, 23 patients died from severe hemorrhagic shock on the day after hospital admission.", "Severe hemorrhagic shock occurred in about 25% of patients.", "All patients who died had hemorrhagic shock.", "The first infections occurred in laboratory workers who were conducting necropsies on imported African green monkeys."], "line_codes": ["0.43223434818931583", "0.5427618507111385", "0.6841001862009883", "0.007912058306521974", "0.4165066217679918", "0.18128993276319672", "0.7359017787215381"], "cached_responses": {"0.43223434818931583": {"evidence_labels": [27], "todelete_spans": [], "replacement_strings": []}, "0.5427618507111385": {"evidence_labels": [0, 9], "todelete_spans": [], "replacement_strings": []}, "0.6841001862009883": {"evidence_labels": [9, 30], "todelete_spans": [[49, 86]], "replacement_strings": [""]}, "0.007912058306521974": {"evidence_labels": [6, 30], "todelete_spans": [[16, 19]], "replacement_strings": [""]}, "0.4165066217679918": {"evidence_labels": [7], "todelete_spans": [], "replacement_strings": []}, "0.18128993276319672": {"evidence_labels": [8], "todelete_spans": [], "replacement_strings": []}, "0.7359017787215381": {"evidence_labels": [9], "todelete_spans": [], "replacement_strings": []}}, "id": "QA_event", "notes": "Source: Wikipedia\nURL: https://en.wikipedia.org/wiki/1967_Marburg_virus_outbreak\n\nResponse generator model: Falcon-7b-instruct\nFact-checking model: Flan-UL2 (4-bit)", "question": "Describe in detail the impact of the Marburg virus on the health of infected people."}
