{"input_lines": ["[Scene: The Hospital, Phoebe is arriving with Ross, Joey, and Rachel in tow.]", "Phoebe: (to the nurse) Hi.", "Nurse: Hi.", "Phoebe: Hi, yeah, hi! I'm umm, Phoebe Buffay, and I have babies coming out of me.", "Nurse: Okay. Have you started having contractions?", "Phoebe: Not yet. Umm, I heard they really hurt, do they hurt?", "Nurse: Well...", "Phoebe: Oh my God!", "Ross: It's all right.", "Nurse: Now, which of you is the father? (Points to Joey and Ross)", "Phoebe: Oh no, none of them are the father. The father is my brother.", "Nurse: (not sure what to do with that) Okay...", "Rachel: I am so gonna miss watching you freak people out like that!", "Joey: Okay, uh Pheebs, quick. Look! This (His video camera) is for the babies to look at someday, so is-is there anything you want to say? Y'know before it all starts?", "Phoebe: Oh, okay, umm, hi kids! Um, it's me, Aunt Phoebe. I can't wait to see you. Please don't hurt me! (Monica and Chandler come running in.) Ross: Hey, what took you guys so long? Your cab left when ours did! (There's a pause as they figure out what to say.) Monica: Well, we-we had to go back because I forget my jacket.", "Chandler: That's right. (Both Rachel and Ross stare at her for a moment.)", "Rachel: You-you're not wearing a jacket.", "Monica: Oh man! I did it again!", "Phoebe: (standing up) Okay, so umm, somebody has to call Frank and Alice. (As she is talking Joey is sticking the camera under her skirt.) And then my mom wants to know-(notices Joey)-Joey, what are you doing?!", "Joey: I gotta get the before shot! (She shakes her head no.) Opening Credits", "[Scene: The delivery room, Rachel and Ross are entering.]", "Rachel: Hi, Pheebs? Okay, so just spoke to the nurse and the reason that your doctor is late is because uh, she's not coming.", "Phoebe: What?!", "Ross: Apparently she fell in the shower and hit her head.", "Phoebe: Oh my God, she's so stupid!", "Ross: Look, Pheebs-Pheebs, it's gonna be okay.", "Phoebe: That's easy for you to say, I don't see three kids coming out your v*g1n*!", "Rachel: Honey, listen, y'know what? The nurse said the doctor is wonderful.", "Ross: Yeah, he's head of the department.", "Phoebe: All right--Ooh! Oh dead God, save me!", "Monica: What?", "Phoebe: I'm having my first contraction!", "Chandler: Oh no. Phoebe: Ooh, it's not bad.", "Chandler: Okay.", "Joey: Oh! (In an announcer type voice) And so the miracle of life begins, and aaiiyyyeeee! (He grabs his side and doubles over in pain.)", "Chandler: Hey! You okay?", "Joey: Ooh, something hurts!", "Phoebe: Ooh, it's sympathy pains. Ohh, that's so sweet!", "Joey: Are they? I didn't know I cared that much. (The doctor, Dr. Harad, enters.)", "Ross: Hello.", "Dr. Harad: Hi! Phoebe, I'm Dr. Harad, I'm going to be delivering your babies. I want you to know, you're gonna be in good hands. I've been doing this for a long time. I'll be back in a minute to do your internal, in the meantime, just relax because everything here looks great. And also, I love Fonzie. (Exits)", "Chandler: Did he just say, he loves Fonzie?", "Monica: That's what it sounded like.", "Chandler: All right...", "Frank: (entering) Hey!", "All: Hey!", "Frank: (To Phoebe) Hey! Am I late? Am I late? Nobody came out yet, right?", "Phoebe: No-no-no! We haven't started yet. Where's Alice?", "Frank: Uh, Delaware. She's on her way though, so until she gets here, I'm gonna be your coach. But don't worry, she told me all about the la-Mazada stuff.", "Chandler: Yeah, that's when if you get the babies out by the end of the month, they give you 2% financing.", "Frank: Yeah.", "[Scene: The waiting room, Monica and Joey are sitting there.]", "Rachel: (entering) Monica? You gonna be very proud of me. I just got us dates with two unbelievably cute nurses.", "Joey: Oh my!", "Rachel: They're male nurses.", "Joey: Not in my head.", "Rachel: Anyway, they want to take us out Saturday night! What do you say?", "Monica: Umm. (Looks at Chandler who is using the phone.) Umm. Umm. I don't think so.", "Rachel: What? What are you talking about?! You-you're the one who's been telling me to get over Ross and move on. I'm moving on, and you're moving on with me. Come on, give me one good reason why you don't wanna go.", "Monica: Umm, why don't you give me something that would be a good reason and-and then I'll tell you if it's true.", "Rachel: What?", "Monica: Harder than it sounds. Isn't it?", "Rachel: Okay, you're coming with me, and I also told them that if we're still here when they get off that we'll go down to the cafeteria and have some Jell-O with them.", "Joey: (in a sexy voice) Yep! There's always room for Jell-O...", "Rachel: Joey, how do you make that dirty? Joey: Oh, it's easy. Yeah, I-I can do it with anything. Watch uh, (snaps his fingers and in a sexy voice) Grandma's chicken salad...", "[Scene: The delivery room, Chandler, Frank, and Ross are with Phoebe.]", "Joey: (entering) Ross! Get a shot of this. (He's carrying an issue of the USA Today and hands Ross the camera.) Hey babies! These are the headlines on the day you were born! Okay, now girl baby turn away and boy babies... (Throws the paper away to reveal a copy of Playpen, which is the TV version of Playboy Magazine.) Check it out, huh?! This is what naked women looked like the month you were born. All right, now let's dive right into the good stuff. (Joey opens the magazine and Ross sticks the camera in it.)", "Phoebe: Oh, okay, I'm having another one! This one doesn't hurt either--Ooh, yes it does! Ow! Ow! Ow! Ow! Ooh! (Checks under the blanket.) Oh, I was kinda hoping that was it.", "Ross: Hey, where are Monica and Rachel anyway?", "Joey: Oh, a couple of nurses asked them out. Maybe they're with them.", "Chandler: Really? Male nurses?", "Joey: Yeah, I was bummed too.", "Chandler: So they're going on dates? When?", "Joey: I think Saturday--(groans in pain again).", "Frank: (To Phoebe) What's with him?", "Phoebe: Umm, sympathy pains. I thought it was really sweet at first, but now I think he's just trying to steal my thunder.", "Dr. Harad: (entering) Okay!", "Phoebe: Hey.", "Dr. Harad: Let's see what we got here. Ohh, y'know, Fonzie dated triplets.", "Chandler: This-this Fonzie person you keep referring too, is that uh, is that another doctor?", "Dr. Harad: Oh no-no-no. Fonzie is the nickname of Arthur Fonzerelli. The Fonz.", "Chandler: All right. (Dr. Harad exits.)", "Frank: It's not that weird, is it?", "Phoebe: It's very weird! I don't want some guy down there telling me, I'm y'know, dilatedamundo!", "Ross: To be fair, he doesn't seem to be impersonating Fonzie...", "Phoebe: (interrupting) What are you doing?!! Why are you defending him?! Just get me another doctor! One who is not crazy and who is not Fonzie!", "Ross: Again, it's not that he... (Phoebe fakes pain to get Ross looking for another doctor.)", "[Scene: The waiting room, Chandler is looking for Monica.]", "Chandler: (spotting her) Oh-hey-hey-hey! There you are!", "Monica: Umm, listen there's something I think you should know.", "Chandler: Oh, is this about you-you dating the nurse? Yeah, Joey already told me, and I am so-so fine. I mean, you and I we're just, y'know, we're nothing, we're goofin' around.", "Monica: Umm, actually I was about to tell you that I was, I was going to get out of it, but hey, if we're just goofing around then uh, maybe I will go out with him.", "Chandler: Fine! Maybe I will too!", "Joey: (entering from the elevator caring gifts for the kids) Hey, you guys! Look what I found in the giiiiiiift shop. (He doubles over in pain in front an old man in a wheel chair.) Get up! Get up! Get up! (The old man waves him away.)", "[Scene: The delivery room, Ross has returned with another doctor. This one, is well, younger.]", "Ross: Okay, Phoebe, this Dr. Oberman. He has no strong feelings about Fonzie or any of the Happy Days gang.", "Phoebe: Hi! And you're going into what grade? Dr.", "Oberman: Umm, I'm actually a first year resident, but I get that a lot, you see, I-I graduated early...", "Phoebe: (interrupting) Uh-huh, me too. Ross, maybe I should've specified that I'd be needing a grown up doctor. Dr.", "Oberman: Oh no, I'm fully qualified to...", "Phoebe: Shh! Doogie, shh! Doesn't anybody understand that I'm gonna be having babies soon? Huh? Go! Go little boy, go! (He runs out and Frank watches him go.)", "Frank: Oh cool! You made him cry!", "[Scene: Another hospital room, Joey has now been admitted and his doctor is about to break the bad news to him, Monica, and Chandler.] Joey's", "Doctor: Mr. Tribbiani, I'm afraid you've got kidney stones.", "Joey: Umm, well, what else could it be? Joey's", "Doctor: It's kidney stones.", "Joey: Or? Joey's", "Doctor: Kidney stones!", "[Scene: The delivery room, Dr. Harad is back and checking on Phoebe.]", "Dr. Harad: All right, you're getting there. Oh, and y'know, these babies are very, very lucky.", "Phoebe: They are. Why?", "Dr. Harad: They have the honor of being born on The Fonz's half-birthday.", "Phoebe: Happy birthday!", "Dr. Harad: Just-just to clarify, I'm not Fonzie. (Phoebe nods in agreement as he leaves.)", "Rachel: Honey, y'know I just gotta tell you, I think this is such a terrific thing you're having these babies for Frank and Alice.", "Phoebe: I know, it is.", "Rachel: Yeah!", "Phoebe: Can I tell you a little secret?", "Rachel: Yeah!", "Phoebe: I want to keep one. (Giggles in excitement.)", "Rachel: Ohh, I'm gonna be on the news! [SCENE_BREAK]", "[Scene: The delivery room, continued from earlier.]", "Rachel: Okay, Phoebe, honey, you gotta be kidding. I mean, you know you cannot keep one of these babies!", "Phoebe: Why not?! Maybe I can, you don't know!", "Rachel: Yes! Yes! Yes, I do! I do know! Frank and Alice are gonna want to keep all of their children!", "Phoebe: Maybe not! Y'know? Seriously, three babies are a handful maybe they're y'know, looking for a chance to unload one of them. Listen, I-I hate to miss an opportunity just because I didn't ask! Y'know?", "Rachel: Phoebe, no! This is, this is insane.", "Phoebe: Oh, just ask him!", "Rachel: Me?!", "Phoebe: I can't ask him! Do you have any idea how inappropriate that would be?! All I'm saying is just talk to Frank. Okay? Just, y'know, feel him out!", "Rachel: No! Forget it! I am not gonna ask Frank to give you one of his kids!!", "Phoebe: You're right. (There's an awkward silence then suddenly Phoebe gets an idea.)", "Phoebe: Tell him it's for you."], "output_lines": ["Feeling guilty over Phoebe missing out on London, the gang plan a weekend trip to Atlantic City, but just as they are about to leave, Phoebe's water breaks and they head to the hospital.", "In an attempt to get over Ross, Rachel asks out two male nurses for her and Monica.", "This causes friction between Monica and Chandler, with Chandler reacting as if he does not care.", "In the delivery room, Phoebe frets about her Fonzie-obsessed doctor.", "Joey, in pain, is diagnosed with kidney stones and admitted to the hospital.", "After giving birth to Frank and Alice's triplets: Frank Jr. Jr, Leslie, and Chandler, Phoebe has difficulty giving them up."], "line_codes": ["0.14684478419984726", "0.1506360335969017", "0.5850831972484889", "0.5753947645814437", "0.18699111480182995", "0.11797733727173254"], "cached_responses": {"0.14684478419984726": {"evidence_labels": [0, 31], "todelete_spans": [[0, 133]], "replacement_strings": [""]}, "0.1506360335969017": {"evidence_labels": [52, 54, 58], "todelete_spans": [], "replacement_strings": []}, "0.5850831972484889": {"evidence_labels": [90], "todelete_spans": [], "replacement_strings": []}, "0.5753947645814437": {"evidence_labels": [40, 41, 85], "todelete_spans": [], "replacement_strings": []}, "0.18699111480182995": {"evidence_labels": [34, 102, 103], "todelete_spans": [], "replacement_strings": []}, "0.11797733727173254": {"evidence_labels": [114, 125], "todelete_spans": [[48, 84]], "replacement_strings": [""]}}, "id": "Summarization_Summscreen", "notes": "This demonstrates a screenplay with its summary taken from a dataset. The screenplay has been truncated to make the fact-checking model run on a single A6000 GPU. Note that due to this truncation, the evidence for some facts in the summary may have been lost.\n\nSource: SummScreen dataset\nURL: https://github.com/mingdachen/SummScreen\nResponse generator model: None (text from ground truth)\nFact-checking model: Flan-UL2 (4-bit)", "question": ""}